I'm seeing the same error on v1.3.0. This is maybe only happening on when modifying a key

```
  # module.litellm[0].litellm_key.this["key1] will be updated in-place
  ~ resource "litellm_key" "this" {
      ~ aliases                    = {} -> (known after apply)
      ~ allowed_cache_controls     = [] -> (known after apply)
      ~ allowed_passthrough_routes = [] -> (known after apply)
      ~ allowed_routes             = [] -> (known after apply)
      + blocked                    = (known after apply)
      ~ config                     = {} -> (known after apply)
      ~ enforced_params            = [] -> (known after apply)
      ~ guardrails                 = [] -> (known after apply)
        id                         = "sha256:<>"
      ~ key                        = (sensitive value)
      + max_budget                 = (known after apply)
      + max_parallel_requests      = (known after apply)
      ~ metadata                   = {} -> (known after apply)
      ~ model_max_budget           = {} -> (known after apply)
      ~ model_rpm_limit            = {} -> (known after apply)
      ~ model_tpm_limit            = {} -> (known after apply)
      ~ permissions                = {} -> (known after apply)
      ~ prompts                    = [] -> (known after apply)
      + rpm_limit                  = (known after apply)
      + soft_budget                = (known after apply)
      ~ tags                       = [] -> (known after apply)
      + tpm_limit                  = (known after apply)
        # (3 unchanged attributes hidden)
    }

...


│ Error: Provider produced inconsistent result after apply
│
│ When applying changes to module.litellm[0].litellm_key.this["key1"], provider "provider[\"registry.terraform.io/ncecere/litellm\"]" produced an unexpected new value: .key:
│ inconsistent values for sensitive attribute.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
```

edit: It looks like this error happens on key deletion. The key then doesn't actually get deleted from LiteLLM. Key creation then works only after I have manually removed the existing key.